Importing all necessary modules

In [124]:
try:
    import pandas as pd
    import numpy as np
    # import matplotlib.pyplot as plt   
    # import time
    # import sys
    print("all modules imported succesfully")
except Exception as e:
    print(e)
    exit()

all modules imported succesfully

# Pandas Tutorial Code

### Creating Series

Using List

In [125]:
list1 = [_ for _ in range(11,66,11)]
ser_form_list1 = pd.Series(list1)
ser_form_list1

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [126]:
list2 = [11,22,"priyang",44,1.33]
ser_form_list2 = pd.Series(list2)
ser_form_list2

0         11
1         22
2    priyang
3         44
4       1.33
dtype: object

Using Tuple

In [127]:
tuple1 = (_ for _ in range(11,66,11))
ser_form_tuple1 = pd.Series(tuple1)
ser_form_tuple1

0    11
1    22
2    33
3    44
4    55
dtype: int64

Using Dictionary

In [128]:
dict1 = {i-1:11*i for i in range(1,6)}
ser_form_dict1 = pd.Series(dict1)
ser_form_dict1

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [129]:
dict2 = {1:11,3:22,5:22,7:33,10:44,12:55}
ser_form_dict2 = pd.Series(dict2)
ser_form_dict2

1     11
3     22
5     22
7     33
10    44
12    55
dtype: int64

Using Numpy Array

In [130]:
numpy_arr1 = np.arange(11,66,11)
ser_form_numpy_arr1 = pd.Series(numpy_arr1)
ser_form_numpy_arr1

0    11
1    22
2    33
3    44
4    55
dtype: int32

Using Scalar Value

In [131]:
scalar_value = 11
ser_form_scalar_value = pd.Series(scalar_value,index=[_ for _ in range(6)])
ser_form_scalar_value

0    11
1    11
2    11
3    11
4    11
5    11
dtype: int64

### Series with custom index

In [132]:
ser_form_list1_cus_idx = pd.Series(list1,index=[chr(97+i) for i in range(5)],dtype=float)
ser_form_list1_cus_idx

a    11.0
b    22.0
c    33.0
d    44.0
e    55.0
dtype: float64

### Accessing Values via Slicing

In [133]:
ser_form_list1[0]

11

In [134]:
ser_form_list1[0:2]

0    11
1    22
dtype: int64

### Operation on Pandas Series

In [135]:
op_s1 = pd.Series([i for i in range(1,6)])
op_s2 = pd.Series([10*i for i in range(1,6)])

In [136]:
op_s1+op_s2

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [137]:
op_s1-op_s2

0    -9
1   -18
2   -27
3   -36
4   -45
dtype: int64

In [138]:
op_s1*op_s2

0     10
1     40
2     90
3    160
4    250
dtype: int64

In [139]:
op_s1/op_s2

0    0.1
1    0.1
2    0.1
3    0.1
4    0.1
dtype: float64

In [140]:
(op_s1+op_s2)**2

0     121
1     484
2    1089
3    1936
4    3025
dtype: int64

If 2 Series have unequal number of element then<br/>
remaining elements will give nan on operations

In [141]:
op_s1+op_s2[:op_s2.size-1]

0    11.0
1    22.0
2    33.0
3    44.0
4     NaN
dtype: float64

### Creating DataFrame

Using List

In [142]:
df_from_list1 = pd.DataFrame([_ for _ in range(11,66,11)])
df_from_list1

    0
0  11
1  22
2  33
3  44
4  55

Using Nested List

In [143]:
df_from_list2 = pd.DataFrame([["Priyang",98],["Vedant",89],["Parshav",88]])
df_from_list2

         0   1
0  Priyang  98
1   Vedant  89
2  Parshav  88

Using Dictionary

In [144]:
dict2 = {"Name":["Priyang","Aadhaya","krishna"],"Marks":[98,89,99]}
df_from_dict = pd.DataFrame(dict2)
df_from_dict

      Name  Marks
0  Priyang     98
1  Aadhaya     89
2  krishna     99

Using Numpy Array

In [145]:
arr_for_df =  np.arange(1,10).reshape(3,-1)
df_from_np_array = pd.DataFrame(arr_for_df,
                columns=[chr(i+97) for i in range(arr_for_df.shape[1])], ## cols
                index=[i for i in range(arr_for_df.shape[0])]) ## no of rows
df_from_np_array

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

Using Series

In [146]:
dict3 = {
    'First':pd.Series([chr(97+i) for i in range(4)]),
    'Second':pd.Series([chr(ord('w')+i) for i in range(4)])
}

df_from_series = pd.DataFrame(dict3)
df_from_series

  First Second
0     a      w
1     b      x
2     c      y
3     d      z

### Dataframe with Custom Index

In [147]:
df_cus_idx = pd.DataFrame(dict2,index=["stu"+str(i) for i in range(1,4)])
df_cus_idx

         Name  Marks
stu1  Priyang     98
stu2  Aadhaya     89
stu3  krishna     99

In [148]:
list3 = [["Priyang",98],["Vedant",89],["Parshav",88]]

df_cus_via_nes_lst = pd.DataFrame(list3,
                    columns=["Name","Marks"],
                    index=[11*(i+1) for i in range(len(list3))]) 
df_cus_via_nes_lst

       Name  Marks
11  Priyang     98
22   Vedant     89
33  Parshav     88

QUESTION SET1

In [149]:
list4 = [["Ahmeddabad",40.1],["Anand",35.2],["Baroda",38.5]]
pd.DataFrame(list4,columns=["City","Temp"],index=[1,2,3])

         City  Temp
1  Ahmeddabad  40.1
2       Anand  35.2
3      Baroda  38.5

### Attributes of Pandas Dataframe

In [150]:
dict_for_df1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,82],
               }
df_from_dict1=pd.DataFrame(dict_for_df1,index=['stu1','stu2','stu3','stu4','stu5','stu6','stu7'])

df_from_dict1

         Name  Marks
stu1  Priyang     98
stu2   Aadhya     89
stu3   Krisha     99
stu4   Vedant     87
stu5   Parshv     90
stu6   Mittal     83
stu7  Archana     82

In [151]:
df_from_dict1.shape

(7, 2)

In [152]:
df_from_dict1.head(2)

         Name  Marks
stu1  Priyang     98
stu2   Aadhya     89

In [153]:
df_from_dict1.tail(2)

         Name  Marks
stu6   Mittal     83
stu7  Archana     82

In [154]:
df_from_dict1.columns

Index(['Name', 'Marks'], dtype='object')

In [155]:
df_from_dict1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, stu1 to stu7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
dtypes: int64(1), object(1)
memory usage: 168.0+ bytes

In [156]:
df_from_dict1['Name']

stu1    Priyang
stu2     Aadhya
stu3     Krisha
stu4     Vedant
stu5     Parshv
stu6     Mittal
stu7    Archana
Name: Name, dtype: object

In [157]:
df_from_dict1.Name

stu1    Priyang
stu2     Aadhya
stu3     Krisha
stu4     Vedant
stu5     Parshv
stu6     Mittal
stu7    Archana
Name: Name, dtype: object

In [158]:
df_from_dict1[['Name','Marks']]

         Name  Marks
stu1  Priyang     98
stu2   Aadhya     89
stu3   Krisha     99
stu4   Vedant     87
stu5   Parshv     90
stu6   Mittal     83
stu7  Archana     82

In [159]:
df_from_dict1['Marks'].min()

82

In [160]:
df_from_dict1['Marks'].max()

99

In [161]:
df_from_dict1['Marks'].mean()

89.71428571428571

In [162]:
df_from_dict1.describe()

           Marks
count   7.000000
mean   89.714286
std     6.676184
min    82.000000
25%    85.000000
50%    89.000000
75%    94.000000
max    99.000000

In [163]:
df_from_dict1['Marks'].value_counts()

Marks
98    1
89    1
99    1
87    1
90    1
83    1
82    1
Name: count, dtype: int64

In [164]:
dict_for_df2 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[99,89,99,87,99,87,82],
               }
df_from_dict2=pd.DataFrame(dict_for_df1,index=['stu1','stu2','stu3','stu4','stu5','stu6','stu7'])

df_from_dict2.value_counts()

Name     Marks
Aadhya   89       1
Archana  82       1
Krisha   99       1
Mittal   83       1
Parshv   90       1
Priyang  98       1
Vedant   87       1
Name: count, dtype: int64

In [165]:
df_from_dict2.count()

Name     7
Marks    7
dtype: int64

In [166]:
df_from_dict2['Marks'].count()

7